# PipeFittingAndAccessoryPressureDropCalculatorNotAvailable Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPCalculationFailures..::..PipeFittingAndAccessoryPressureDropCalculatorNotAvailable Property
BuiltInFailures..::..MEPCalculationFailures Class See Also
---
Pipe Fitting/Accessory Pressure Drop Calculator Not Available: [Calculator Name]
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId PipeFittingAndAccessoryPressureDropCalculatorNotAvailable { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PipeFittingAndAccessoryPressureDropCalculatorNotAvailable As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ PipeFittingAndAccessoryPressureDropCalculatorNotAvailable {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPCalculationFailures Class
Autodesk.Revit.DB Namespace